In [1]:
import sqlite3
import pandas as pd

In [2]:
# connect to the database I created in the sample python script

db_connection = sqlite3.connect("../data/test_database.db")

# read from the table I was adding data to, to make sure everything is working correctly
query = """select *
            from test_table"""

pd.read_sql(query, db_connection)

  user_name user_age       timestamp
0     Sarah       34  20230207211454
1       Bob       55  20230207211500
2      Test     Test  20230207211511
3     Sarah      100  20230216162836
4     Sarah       99  20230216162920